# 10 Import Excel file creating standard date variable

This Jupyter notebook will expand on the topic covered by previous one. After importing Excel file into Python, I will create a new variable as standard Python date variable from a character variable

## 1. Import Excel data into Python

- Import required libraries

In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
wd = os.getcwd()
print(f'My working directory is:{wd}')

My working directory is:/home/pablo/Documents/Pablo_ubuntu/Python_github_projects/ML-using-Python/data_wrangling_scripts

In [3]:
project_folder = os.path.join('/home','pablo','Documents','Pablo_ubuntu','Python_github_projects','ML-using-Python')
os.chdir(project_folder)

In [5]:
data_folder = os.path.join('/home','pablo','Documents','Pablo_ubuntu','Python_github_projects','ML-using-Python','data')

In [6]:
print(f'Data fodler path:{project_folder}')
print(f'Data fodler path:{data_folder}')

Data fodler path:/home/pablo/Documents/Pablo_ubuntu/Python_github_projects/ML-using-Python
Data fodler path:/home/pablo/Documents/Pablo_ubuntu/Python_github_projects/ML-using-Python/data

- Display data folder contents

In [7]:
data_folder_contents = os.listdir(data_folder)
print(f'Data folder contents:{data_folder_contents}')

Data folder contents:['monthly-milk-production-pounds.csv', 'winequality-white.csv', 'Monthly-AE-Time-Series-March-2025.xls', 'ONS_long_term_immigration_end2024.xlsx', 'AE_Attendances_TypeI_2010_2025.csv', '03_INE_Spain_natural_growh_births_deaths.xlsx', 'winequality-red.csv', 'INE Resident population country of birth Spain.xlsx', 'ONS_Figure_01_Long_term_emigration_immigration_net_migration.xlsx', 'Monthly-AE-Time-Series-January-2024.xls', 'wine_quality.zip', 'OCDE_countries_population_figures_1970_2022.csv', 'AE_Time_Series_Data_website.txt', '01 INE resident population by nationality Spain and CV 2002 2024.xlsx', 'AE_Attendances_2010_2024.csv', 'INE total and foreign population figures Spain.xlsx', 'Type_I_ATT_TEST.csv', 'all_wine_reset.csv', 'winequality.names', 'AE_Attendances_Aug2010_Mar_2025.csv', '02 INE Spain CV population stocks and flows 2002 2025.xlsx', 'Type_I_ATT_TRAIN.csv', 'ONS_Figure_2__Population_increase_in_mid-2023_was_driven_mostly_by_net_international_migration.xls']

- Display just Files ending in .xlsx in our data_folder path

In [9]:
for file in os.listdir(data_folder):
    if file.endswith(".xlsx"):
        print(os.path.join("/data", file))

/data/ONS_long_term_immigration_end2024.xlsx
/data/03_INE_Spain_natural_growh_births_deaths.xlsx
/data/INE Resident population country of birth Spain.xlsx
/data/ONS_Figure_01_Long_term_emigration_immigration_net_migration.xlsx
/data/01 INE resident population by nationality Spain and CV 2002 2024.xlsx
/data/INE total and foreign population figures Spain.xlsx
/data/02 INE Spain CV population stocks and flows 2002 2025.xlsx

- Importing Excel file "INE total and foreign population figures Spain.xlsx" from \data sub-folder.

In [10]:
data_raw = pd.read_excel(os.path.join('data','INE total and foreign population figures Spain.xlsx'),
                         sheet_name = 'INE_Total_population',
                         skiprows = 7, 
                         usecols='A:B',
                         nrows = 212)
data_raw.head()

                            Total
0    1 de enero de 2024  48619695
1  1 de octubre de 2023  48486865
2    1 de julio de 2023  48320520
3    1 de abril de 2023  48205962
4    1 de enero de 2023  48085361

In [11]:
data_raw.info

<bound method DataFrame.info of                               Total
0      1 de enero de 2024  48619695
1    1 de octubre de 2023  48486865
2      1 de julio de 2023  48320520
3      1 de abril de 2023  48205962
4      1 de enero de 2023  48085361
..                    ...       ...
207    1 de abril de 1972
208    1 de enero de 1972  34408338
209  1 de octubre de 1971
210    1 de julio de 1971  34216856
211    1 de abril de 1971

[212 rows x 2 columns]>

In [12]:
data_raw.head()
print(data_raw)

                              Total
0      1 de enero de 2024  48619695
1    1 de octubre de 2023  48486865
2      1 de julio de 2023  48320520
3      1 de abril de 2023  48205962
4      1 de enero de 2023  48085361
..                    ...       ...
207    1 de abril de 1972
208    1 de enero de 1972  34408338
209  1 de octubre de 1971
210    1 de julio de 1971  34216856
211    1 de abril de 1971

[212 rows x 2 columns]

In [13]:
data_raw.columns

Index([' ', 'Total'], dtype='object')

- Rename default column names from imported Excel file into Python

In [14]:
data_raw.columns = ['Year','Total_population']
data_raw.head()

                   Year Total_population
0    1 de enero de 2024         48619695
1  1 de octubre de 2023         48486865
2    1 de julio de 2023         48320520
3    1 de abril de 2023         48205962
4    1 de enero de 2023         48085361

In [15]:
data_raw.tail()

                     Year Total_population
207    1 de abril de 1972
208    1 de enero de 1972         34408338
209  1 de octubre de 1971
210    1 de julio de 1971         34216856
211    1 de abril de 1971

### 1. Remove NaN values from Dataframe

- First issue I need to tacke is that we don't have NaN values. We have Empty values in the bottom cells in Total_population column, from the original Excel file imported into Python

In [19]:
count_data_raw = data_raw.shape[0]  # Gives number of rows
print(count_data_raw)

212

In [16]:
imported_data_na = data_raw.replace(r'^\s*$',np.nan, regex = True)
print(imported_data_na)

                     Year  Total_population
0      1 de enero de 2024        48619695.0
1    1 de octubre de 2023        48486865.0
2      1 de julio de 2023        48320520.0
3      1 de abril de 2023        48205962.0
4      1 de enero de 2023        48085361.0
..                    ...               ...
207    1 de abril de 1972               NaN
208    1 de enero de 1972        34408338.0
209  1 de octubre de 1971               NaN
210    1 de julio de 1971        34216856.0
211    1 de abril de 1971               NaN

[212 rows x 2 columns]

/tmp/ipykernel_10280/580462554.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  imported_data_na = data_raw.replace(r'^\s*$',np.nan, regex = True)

- Now that we have our data with Missing values in the "Total_population" column, I can use the .dropna() method

In [17]:
imported_data_clean_dropna = imported_data_na.dropna(axis = 0, 
                subset = ['Total_population'],
                inplace = False)
imported_data_clean_dropna.head()
imported_data_clean_dropna.tail()

                   Year  Total_population
202  1 de julio de 1973        34980317.0
204  1 de enero de 1973        34800600.0
206  1 de julio de 1972        34595886.0
208  1 de enero de 1972        34408338.0
210  1 de julio de 1971        34216856.0

In [18]:
count_row_clean_test = imported_data_clean_dropna.shape[0]  # Gives number of rows
print(count_row_clean_test)

112

## 2. Flag January rows to keep just those rows

As I used in previous script "09 Import Excel file replacing blanks by nulls.ipynb" this is the way I flag January (Enero) rows in the dataframe.

In [21]:
imported_data_flag = imported_data_clean_dropna.copy()

In [22]:
imported_data_flag.loc[imported_data_flag['Year'].str.contains('enero',case = False),'Jan_flag'] = 'Y'

In [23]:
imported_data_flag.head()

                   Year  Total_population Jan_flag
0    1 de enero de 2024        48619695.0        Y
1  1 de octubre de 2023        48486865.0      NaN
2    1 de julio de 2023        48320520.0      NaN
3    1 de abril de 2023        48205962.0      NaN
4    1 de enero de 2023        48085361.0        Y

### 2.1 Then we can subset rows with 'Y' Flag in them

From the imported_data_flag dataframe we will keep just records with Y values in Jan_flag column:

In [24]:
final_population_data = imported_data_flag[imported_data_flag.Jan_flag == 'Y']
final_population_data.head()
final_population_data.tail()

                   Year  Total_population Jan_flag
192  1 de enero de 1976        35946425.0        Y
196  1 de enero de 1975        35569375.0        Y
200  1 de enero de 1974        35177294.0        Y
204  1 de enero de 1973        34800600.0        Y
208  1 de enero de 1972        34408338.0        Y

In [25]:
df_rows = final_population_data
num_rows_final_population_data = len(df_rows.index)
print(f'Number of rows:{num_rows_final_population_data}')

Number of rows:53

In [26]:
final_population_data.head()

                  Year  Total_population Jan_flag
0   1 de enero de 2024        48619695.0        Y
4   1 de enero de 2023        48085361.0        Y
8   1 de enero de 2022        47486727.0        Y
12  1 de enero de 2021        47400798.0        Y
16  1 de enero de 2020        47318050.0        Y

In [ ]:
.tail()

                   Year  Total_population Jan_flag
192  1 de enero de 1976        35946425.0        Y
196  1 de enero de 1975        35569375.0        Y
200  1 de enero de 1974        35177294.0        Y
204  1 de enero de 1973        34800600.0        Y
208  1 de enero de 1972        34408338.0        Y

## 3. Creating new Date varaible from character columns

- Display first column types

In [32]:
type(final_population_data)

pandas.core.frame.DataFrame

- We can display different data types included in the Pandas DataFrame

In [30]:
final_population_data.dtypes

Year                 object
Total_population    float64
Jan_flag             object
dtype: object

- Create new varaibles subtracting sections of Year string column

- First I want a new column for the day (using str[:1]

In [47]:
final_population_data['day'] = final_population_data['Year'].str[:1]
final_population_data.head()

/tmp/ipykernel_10280/737695263.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_population_data['day'] = final_population_data['Year'].str[:1]

                  Year  Total_population Jan_flag date_day  month  year day
0   1 de enero de 2024        48619695.0        Y        1  enero  2024   1
4   1 de enero de 2023        48085361.0        Y        1  enero  2023   1
8   1 de enero de 2022        47486727.0        Y        1  enero  2022   1
12  1 de enero de 2021        47400798.0        Y        1  enero  2021   1
16  1 de enero de 2020        47318050.0        Y        1  enero  2020   1

- Then We want a new variable to substract the Month

In [48]:
final_population_data['month'] = final_population_data['Year'].str[5:10]
final_population_data.head()

/tmp/ipykernel_10280/2604275464.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_population_data['month'] = final_population_data['Year'].str[5:10]

                  Year  Total_population Jan_flag date_day  month  year day
0   1 de enero de 2024        48619695.0        Y        1  enero  2024   1
4   1 de enero de 2023        48085361.0        Y        1  enero  2023   1
8   1 de enero de 2022        47486727.0        Y        1  enero  2022   1
12  1 de enero de 2021        47400798.0        Y        1  enero  2021   1
16  1 de enero de 2020        47318050.0        Y        1  enero  2020   1

- Finally we will extract the year from Year column

In [49]:
final_population_data['year'] = final_population_data['Year'].str[-4:]
final_population_data.head()

/tmp/ipykernel_10280/947643015.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_population_data['year'] = final_population_data['Year'].str[-4:]

                  Year  Total_population Jan_flag date_day  month  year day
0   1 de enero de 2024        48619695.0        Y        1  enero  2024   1
4   1 de enero de 2023        48085361.0        Y        1  enero  2023   1
8   1 de enero de 2022        47486727.0        Y        1  enero  2022   1
12  1 de enero de 2021        47400798.0        Y        1  enero  2021   1
16  1 de enero de 2020        47318050.0        Y        1  enero  2020   1

- Then I will recode month from "enero" that is January into 01 to be able to use pd.to_datetime() in the next step

### 3.1 Now I only have to combine  Creating new Date

 THen I will combine those separate ["year"], ["month"] and ["day"] columns into a proper Python date variable using the pd.to_datetime() method.